{
  "__document_status__": "Active",
  "id": "19",
  "name": "Loopar Concepts",
  "module": "loopar-web",
  "doc_structure": "[{\"element\":\"menu_content\",\"data\":{\"label\":\"Menu_content2\",\"key\":\"menu_content2_el321766053488\"},\"elements\":[{\"element\":\"fragment\",\"data\":{\"label\":\"Menu_content1\",\"key\":\"qskfrnxtu\"},\"elements\":[{\"element\":\"link\",\"data\":{\"label\":\"Main Entities\",\"key\":\"link1_el112305512711\",\"to\":\"#main-entities\",\"background_image\":[]},\"elements\":[]}]},{\"element\":\"fragment\",\"data\":{\"label\":\"Menu_content1\",\"key\":\"cyls2rugq\"},\"elements\":[{\"element\":\"markdown\",\"data\":{\"label\":\"Markdown1\",\"key\":\"markdown1_el226376629411\",\"value\":\"# Main Entities  \\n\\n## 1. Entity  \\n**Entity** is the core model of the system, serving as the foundation for creating various types of models. It allows users to define components, organize metadata, and generate the necessary backend and frontend structures for models such as pages, views, and forms. The drag-and-drop interface and flexibility make it a versatile tool for general-purpose model creation.  \\n\\n---\\n\\n## 2. Builders  \\n**Builders** are specialized entities created using the **Entity** model, designed to generate specific types of models. While Entity offers general-purpose functionality, Builders focus on tailoring metadata and functionality to meet the requirements of particular model types. This eliminates unnecessary metadata and ensures optimized structures for each case.  \\n\\n### Types of Builders  \\n\\n- **Page Builder**  \\n  Focused on creating desktop or web pages, the **Page Builder** provides all the tools needed to design complete web pages such as homepages, blogs, or landing pages. It ensures only the essential metadata for a page is included, offering a streamlined and efficient page-building experience.  \\n\\n- **View Builder**  \\n  The **View Builder** creates models designed specifically for rendering data. Its main function is to connect to a model and visually display its metadata. It also allows users to customize the layout and presentation of the view, offering flexibility for unique display needs.  \\n\\n- **Form Builder**  \\n  The **Form Builder** is specialized in creating forms. Its primary purpose is to facilitate data collection and submission to a controller. Examples include login forms, password recovery forms, or specific forms for handling segments of a model.  \\n\\n- **Controller Builder**  \\n  The **Controller Builder** focuses on generating the structure of server-side controllers. It is ideal for creating controllers such as `LoginController` that manage specific actions like login, registration, or password reset. Controllers built this way enable the creation of routes and actions without requiring a full model, providing an efficient solution for specific backend tasks.  \\n\\n---\\n\\nBy providing these specialized Builders, Loopar ensures a highly efficient and streamlined development process, where each model type is perfectly adapted to its intended purpose.\\n\\n\",\"id\":\"main-entities\",\"background_image\":[]},\"elements\":[]}]}]}]",
  "__ENTITY__": "Page Builder"
}