{
  "__document_status__": "Active",
  "name": "Loopar Introduction",
  "module": "loopar-web",
  "doc_structure": "[{\"element\":\"menu_content\",\"data\":{\"id\":\"menu_content1_el702527834072\",\"name\":\"menu_content1_el702527834072\",\"label\":\"Menu_content1\",\"key\":\"menu_content1_el702527834072\"},\"elements\":[{\"element\":\"fragment\",\"data\":{\"name\":\"menu_content2_el384220669566\",\"label\":\"Menu_content2\",\"key\":\"menu_content2_el384220669566\"},\"elements\":[{\"element\":\"link\",\"data\":{\"id\":\"link1_el459828710390\",\"name\":\"link1_el459828710390\",\"label\":\"Overview\",\"key\":\"link1_el459828710390\",\"to\":\"#overview\"},\"elements\":[]}]},{\"element\":\"fragment\",\"data\":{\"name\":\"menu_content3_el714977108528\",\"label\":\"Menu_content3\",\"key\":\"menu_content3_el714977108528\"},\"elements\":[{\"element\":\"markdown\",\"data\":{\"id\":\"overview\",\"name\":\"markdown2_el128606491111\",\"label\":\"Markdown2\",\"key\":\"markdown2_el128606491111\",\"value\":\"# Loopar: The Drag-and-Drop Framework that Revolutionizes Web Development\\n\\nWelcome to Loopar, the revolutionary full stack drag-and-drop framework that empowers you to turn your web development vision into reality. Loopar provides an intuitive and powerful graphical interface, eliminating the need for complex integrations or external tools. Design and build your web projects visually, with complete control over every element and interaction through a simple drag-and-drop operation.\\n\\n## Key Features\\n\\n### Integrated MVC Model\\n\\nLoopar offers a revolutionary visual interface while incorporating an integrated MVC (Model-View-Controller) model. This provides robustness by allowing you to separate your development logic effectively. Maintain a clean, organized, and scalable code structure by keeping actions, models, and public files distinct.\\n\\n### Organized and Scalable Code\\n\\nEnjoy the benefits of a well-organized code structure that supports scalability. Loopar helps you keep your actions, models, and public files neatly separated, making your projects easier to manage and expand.\\n\\n### Total Flexibility\\n\\nLoopar is both no-code and full-code, giving you the best of both worlds. Create your entire interface visually while retaining the flexibility to add custom development logic to your projects. This dual approach ensures that you can work efficiently and creatively, without any limitations.\\n\\n### Integration and Extensibility\\n\\nAlthough Loopar simplifies development by eliminating the need for external tools, it also offers robust integration options. Extend its functionality with additional libraries and frameworks to meet the specific needs of your projects.\\n\\n### Fast Deployment\\n\\nAccelerate the development and deployment process of your web applications with Loopar. Reduce time to market significantly, allowing you to bring your projects to life faster and more efficiently.\\n\\n## Benefits of Using Loopar\\n\\n### Time and Resource Savings\\n\\nSimplify the development and maintenance of complex web applications without sacrificing quality or functionality. Loopar helps you save time and resources by streamlining the development process.\\n\\n### Accessible for Everyone\\n\\nLoopar is ideal for both experienced developers and beginners. Its intuitive and visual approach makes it easy for anyone to start creating and managing web projects, regardless of their technical expertise.\\n\\n### Enhanced Collaboration\\n\\nImprove collaboration between design and development teams by providing a common and accessible platform. Loopar fosters better communication and coordination, leading to more cohesive and successful projects.\\n\\n## Get Started with Loopar\\n\\n**Loopar: the future of web development is here.** Join the revolution and transform the way you create and manage your web projects.\\n\\nFor more information and to start your journey with Loopar, visit our [website](https://www.loopar.com) or contact us directly. Your creativity is the limit!\\n\\n---\\n\\nThank you for choosing Loopar. We look forward to seeing the incredible projects you will create with our platform.\\n\"}}]}]}]",
  "__ENTITY__": "Page Builder"
}